---
kind: other
id: Methods.T:Autodesk.Revit.DB.KeyBasedTreeEntry
source: html/c5974be8-ca36-7057-0f44-ae20e4206c96.htm
---
# KeyBasedTreeEntry Methods

Gets a collection containing the keys of all children entry objects from this entry.